In [61]:
#joblib
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression
import matplotlib.pyplot as plt
import math

In [62]:
df=pd.read_csv(r"D:\harry bhai\pandas and numpy\House_Price_Mult.csv")

In [63]:
df

    Area  Bedroom  Age   Price
0   2600      3.0   20  550000
1   3000      4.0   15  565000
2   3200      NaN   18  610000
3   3600      3.0   30  595000
4   4000      5.0    8  760000
5   4300      4.0   15  751000
6   4640      7.0   25  796000
7   4980      5.0   17  841000
8   5320      NaN   18  886000
9   5660      5.0   15  931000
10  6000      6.0   11  976000

In [64]:
df["Bedroom"].replace(np.NaN,mean,inplace=True)

In [65]:
mean=math.ceil(df["Bedroom"].mean())

In [66]:
df

    Area  Bedroom  Age   Price
0   2600      3.0   20  550000
1   3000      4.0   15  565000
2   3200      5.0   18  610000
3   3600      3.0   30  595000
4   4000      5.0    8  760000
5   4300      4.0   15  751000
6   4640      7.0   25  796000
7   4980      5.0   17  841000
8   5320      5.0   18  886000
9   5660      5.0   15  931000
10  6000      6.0   11  976000

In [67]:
model=LinearRegression()

In [68]:
model.fit(df.drop("Price",axis=1),df["Price"])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [69]:
model.predict([[7000,7,21]])

array([1088226.83141912])

In [70]:
model.coef_

array([  121.43464326,  9221.6591251 , -3273.2112173 ])

In [71]:
model.intercept_

242370.1502547816

In [72]:
from sklearn.externals import joblib

In [73]:
joblib.dump(model,'D:\harry bhai\dumpmodel')
df

    Area  Bedroom  Age   Price
0   2600      3.0   20  550000
1   3000      4.0   15  565000
2   3200      5.0   18  610000
3   3600      3.0   30  595000
4   4000      5.0    8  760000
5   4300      4.0   15  751000
6   4640      7.0   25  796000
7   4980      5.0   17  841000
8   5320      5.0   18  886000
9   5660      5.0   15  931000
10  6000      6.0   11  976000

In [98]:
def showprice():
    area=float(input("enter the area"))
    Bedroom=float(input("enter the Bedroom"))
    Age=float(input("enter the age"))
    l=area,Bedroom,Age
    print(l)
    arr=np.array(l)
    arr=arr.reshape(1,3)
    joblib.load('D:\harry bhai\dumpmodel')
    print(model.predict(arr))
    print("now check by mx+c")
    y=model.coef_[0]*area+model.coef_[1]*Bedroom+model.coef_[2]*Age+model.intercept_
    print(y)

In [99]:
showprice()

enter the area123456
enter the Bedroom4
enter the age32
(123456.0, 4.0, 32.0)
[15166349.34667111]
now check by mx+c
15166349.346671112

In [106]:
from sklearn.externals import pickel5

ImportError: cannot import name 'pickel5' from 'sklearn.externals' (C:\Users\OM\Anaconda3\lib\site-packages\sklearn\externals\__init__.py)